MukhtarKhan17/Projects/Mcuboot Stm32/SRC/HAL/hal_flash_stm32f103rx.h
/**
*##############################################################################
*####################### # # # ################ # # # #########################
*######################## # # # ############## # # # ##########################
*######################### # # # ############ # # # ###########################
*########################## # # # ########## # # # ############################
*########################### # # # ######## # # # #############################
*############################ # # # ###### # # # ##############################
*############################# # # # #### # # # ###############################
*############################## # # # ## # # # ################################
*############################### # # #  # # # #################################
*################################ # # ## # # ##################################
*############################### V O I D R O N ################################
*##############################################################################
*==============================================================================
* @{ <h2><center>           (C) VOIDRON CO. 2023.          </center></h2> @}
*==============================================================================
* @attention
*
* THIS CONTENT IS DESIGNED AND  DEVELOPED BY VOIDRON CO. UNATUHORISED  USED  IS
* PROHIBITED. CONTENT  OF  THIS  FILE  MAY  BE  UNPUBLISHED  OR   CONFIDENTIAL.
* SELLING  OR DISTRIBUTION  WILL  VOID  THE  LICENSE  AND  AGREEMENT  WITH  US.
* DOING  SO MAY LEAD TO  TAKE LEGAL  ACTION BY US  WHICH MAY RESULT IN PENALISE
* OFFENCE CHARGES ON YOU. DON'T  TRY TO MODIFY THE CONTENT OF THIS FILE, IT MAY
* GIVE  UNWANTED  RESULTS. IF  YOU  FIND  ANY TROUBLE  OR WANT  CHANGES  PLEASE
* CONTACT US.
*==============================================================================
* Email: contact@voidron.com          |          Website: www.voidron.com
*==============================================================================
*/

/**
*==============================================================================
*                             \V/ File DetaiL
*==============================================================================
* @file     hal_flash_stm32f103rx.h
* @version  V1.0.0
* @brief    HAL Flash Routines
*           + Flash Page Write
*           + Flash Page Read
*           + Flash Page Erase
* @author   MK
* @date     27-FEB-2021
* @remark   Designed & Developed by Voidron Co.
*==============================================================================
*/

#ifndef HAL_FLASH_STM32F103RX_H_
#define HAL_FLASH_STM32F103RX_H_

#ifndef __VOIDRON__
#define __VOIDRON__
#endif

/**
*==============================================================================
*                             \V/ Include SectioN
*==============================================================================
*/
#include "vdef_types.h"
#include "string.h"
#include "stm32f10x.h"
#include "stm32f10x_flash.h"


/**
*==============================================================================
*                          	  \V/ Global DefineS
*==============================================================================
*/
#define FLASH_PAGE_SIZE				    (2048U)
#define FLASH_PAGE_0_ADDR		        (0x08000000U)
#define FLASH_PAGE_1_ADDR		        (0x08000800U)
#define FLASH_PAGE_254_ADDR		        (0x0807F000U)
#define FLASH_PAGE_255_ADDR		        (0x0807F800U)


/**
*==============================================================================
*                          	  \V/ Global MacroS
*==============================================================================
*/
// >> 1. Global Macros

/**
*==============================================================================
*                           \V/ Global Data TypeS
*==============================================================================
*/
typedef enum
{
	NO_ERROR,
	FLASH_PROG_ERR,
	FLASH_SIZE_EXCEDEED,
	PAGE_SIZE_EXCEEDED,
	PAGE_ADDR_ERR,
}flash_sts_t;

/**
*==============================================================================
*                            \V/ Global VariableS
*==============================================================================
*/
// >> Declare Global Variables Here.

/**
*==============================================================================
*                        \V/ Global Function PrototypeS
*==============================================================================
*/

extern void Flash_PageErase(uint32_t page_addr);

extern void Flash_PageWrite(uint32_t page_addr,
		                    void *data_ptr,
		                    uint16_t data_sz);

extern void Flash_PageRead(uint32_t page_addr,
		           	   	   const void *data_ptr,
		                   uint16_t data_sz);

extern void Flash_EnableRdProtect(void);
extern void Flash_DisableRdProtect(void);
/**
*##############################################################################
*                             \V/ File HistorY
*##############################################################################
* @version  V1.0.0
* @author   MK
* @date     27-FEB-2021
* @brief    Initial Release
*           ---
*           ---
*           ---
*------------------------------------------------------------------------------
* @version  V1.0.1
* @author   XX
* @date     DD-MMM-YYYY
* @brief    <Add Change Description>
*           ---
*           ---
*           ---
*##############################################################################
*================================End of FilE===================================
*##############################################################################
*/
// >> 086 079 073 068 082 079 078
#endif // >> End of HAL_FLASH_STM32F103RX_H_

